<a href="https://colab.research.google.com/github/mansibamgude/demo/blob/main/task_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

EXERCISE 5.1 Create a Pandas DataFrame from Lists: the elements in the list are 'John', 'Smith', 'Alen', 'Jack' and the name of the list is list1

In [ ]:
import pandas as pd

list1 = ['John', 'Smith', 'Alen', 'Jack']
df = pd.DataFrame(list1, columns=['Names'])
print("DataFrame:\n", df)

DataFrame:
    Names
0   John
1  Smith
2   Alen
3   Jack

EXERCISE 5.2 Create Dataframe using list with index and column names where the dataframe name is df and the elements in the list are 'John', 'Smith', ', christian', 'Joseph'

In [ ]:
import pandas as pd

list1 = ['John', 'Smith', 'Christian', 'Joseph']
index_names = ['A', 'B', 'C', 'D']
column_name = 'Names'
df = pd.DataFrame(list1, columns=[column_name], index=index_names)
print("DataFrame:\n", df)

DataFrame:
        Names
A       John
B      Smith
C  Christian
D     Joseph

EXERCISE 5.3 Create Dataframe named df using zip() for zipping two lists with 'USA','INDIA', 'CHINA', 'JAPAN', 'ENGLAND' in the 1st list and 11, 22, 33, 44, 55 in the second list and the column name is 'country' and 'label'

In [ ]:
import pandas as pd

list_countries = ['USA', 'INDIA', 'CHINA', 'JAPAN', 'ENGLAND']
list_labels = [11, 22, 33, 44, 55]
zipped_list = list(zip(list_countries, list_labels))
df = pd.DataFrame(zipped_list, columns=['country', 'label'])
print("DataFrame:\n", df)

DataFrame:
    country  label
0      USA     11
1    INDIA     22
2    CHINA     33
3    JAPAN     44
4  ENGLAND     55

EXERCISE 5.4 Creating DataFrame using multi-dimensional list

In [ ]:
import pandas as pd

data = [
    ['John', 25, 'USA'],
    ['Smith', 30, 'UK'],
    ['Alen', 22, 'Canada'],
    ['Jack', 28, 'Australia']
]
columns = ['Name', 'Age', 'Country']
df = pd.DataFrame(data, columns=columns)
print("DataFrame:\n", df)

DataFrame:
     Name  Age    Country
0   John   25        USA
1  Smith   30         UK
2   Alen   22     Canada
3   Jack   28  Australia

EXECRCISE 5.5 Create a dataframe Using multi-dimensional list with column names as FName , LName and Age and dtype FLOAT.

In [ ]:
import pandas as pd

data = [
    ['John', 'Doe', 25],
    ['Smith', 'Brown', 30],
    ['Alen', 'Walker', 22],
    ['Jack', 'Daniels', 28]
]
columns = ['FName', 'LName', 'Age']
df = pd.DataFrame(data, columns=columns)
df['Age'] = df['Age'].astype(float)
print("DataFrame:\n", df)
print("\nData types:\n", df.dtypes)

DataFrame:
    FName    LName   Age
0   John      Doe  25.0
1  Smith    Brown  30.0
2   Alen   Walker  22.0
3   Jack  Daniels  28.0

Data types:
 FName     object
LName     object
Age      float64
dtype: object

EXERCISE 5.6 Create a dataframe using lists in dictionary to create dataframe

In [ ]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

EXERCISE 5.7 Create 2 data dictionary named d1 and d2 and convert them into dataframe named df12 and df21

In [ ]:
import pandas as pd

d1 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

d2 = {
    'Name': ['David', 'Eve', 'Frank'],
    'Age': [32, 25, 29],
    'City': ['Houston', 'Miami', 'Seattle']
}
df12 = pd.DataFrame(d1)
df21 = pd.DataFrame(d2)
print("df12:")
print(df12)
print("\ndf21:")
print(df21)

df12:
      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

df21:
    Name  Age     City
0  David   32  Houston
1    Eve   25    Miami
2  Frank   29  Seattle

EXERCISE 5.8 Concatenate the data frames created above

In [ ]:
import pandas as pd

d1 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

d2 = {
    'Name': ['David', 'Eve', 'Frank'],
    'Age': [32, 25, 29],
    'City': ['Houston', 'Miami', 'Seattle']
}

df12 = pd.DataFrame(d1)
df21 = pd.DataFrame(d2)

concatenated_df = pd.concat([df12, df21], ignore_index=True)

print(concatenated_df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eve   25        Miami
5    Frank   29      Seattle
      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eve   25        Miami
5    Frank   29      Seattle

*EXERCISE 5.9 * Create two dataframes for student details with the attributes ADDRESS AGE MOBILE NO NAME QUALIFICATION with any random values from the dictionary.

In [ ]:
import pandas as pd

data1 = {
    'NAME': ['Alice', 'Bob', 'Charlie'],
    'AGE': [20, 22, 21],
    'ADDRESS': ['123 Main St', '456 Elm St', '789 Oak St'],
    'MOBILE NO': ['111-111-1111', '222-222-2222', '333-333-3333'],
    'QUALIFICATION': ['Bachelor', 'Master', 'PhD']
}

data2 = {
    'NAME': ['David', 'Eve', 'Frank'],
    'AGE': [23, 24, 25],
    'ADDRESS': ['321 Pine St', '654 Cedar St', '987 Maple St'],
    'MOBILE NO': ['444-444-4444', '555-555-5555', '666-666-6666'],
    'QUALIFICATION': ['Master', 'Bachelor', 'Bachelor']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
      NAME  AGE      ADDRESS     MOBILE NO QUALIFICATION
0    Alice   20  123 Main St  111-111-1111      Bachelor
1      Bob   22   456 Elm St  222-222-2222        Master
2  Charlie   21   789 Oak St  333-333-3333           PhD

DataFrame 2:
    NAME  AGE       ADDRESS     MOBILE NO QUALIFICATION
0  David   23   321 Pine St  444-444-4444        Master
1    Eve   24  654 Cedar St  555-555-5555      Bachelor
2  Frank   25  987 Maple St  666-666-6666      Bachelor

EXERCISE 5.10 Now concatenate the above dataframes by seting the attribue join to inner

In [ ]:
import pandas as pd

data1 = {
    'NAME': ['Alice', 'Bob', 'Charlie'],
    'AGE': [20, 22, 21],
    'ADDRESS': ['123 Main St', '456 Elm St', '789 Oak St'],
    'MOBILE NO': ['111-111-1111', '222-222-2222', '333-333-3333'],
    'QUALIFICATION': ['Bachelor', 'Master', 'PhD']
}

data2 = {
    'NAME': ['David', 'Eve', 'Frank'],
    'AGE': [23, 24, 25],
    'ADDRESS': ['321 Pine St', '654 Cedar St', '987 Maple St'],
    'MOBILE NO': ['444-444-4444', '555-555-5555', '666-666-6666'],
    'QUALIFICATION': ['Master', 'Bachelor', 'Bachelor']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

concatenated_df = pd.concat([df1, df2], join='inner')

print("Concatenated DataFrame with inner join:")
print(concatenated_df)

Concatenated DataFrame with inner join:
      NAME  AGE       ADDRESS     MOBILE NO QUALIFICATION
0    Alice   20   123 Main St  111-111-1111      Bachelor
1      Bob   22    456 Elm St  222-222-2222        Master
2  Charlie   21    789 Oak St  333-333-3333           PhD
0    David   23   321 Pine St  444-444-4444        Master
1      Eve   24  654 Cedar St  555-555-5555      Bachelor
2    Frank   25  987 Maple St  666-666-6666      Bachelor

EXERCISE 5.11 Now concate the above dataframes that you have created using outer join

In [ ]:
import pandas as pd

data1 = {
    'NAME': ['Alice', 'Bob', 'Charlie'],
    'AGE': [20, 22, 21],
    'ADDRESS': ['123 Main St', '456 Elm St', '789 Oak St'],
    'MOBILE NO': ['111-111-1111', '222-222-2222', '333-333-3333'],
    'QUALIFICATION': ['Bachelor', 'Master', 'PhD']
}

data2 = {
    'NAME': ['David', 'Eve', 'Frank'],
    'AGE': [23, 24, 25],
    'ADDRESS': ['321 Pine St', '654 Cedar St', '987 Maple St'],
    'MOBILE NO': ['444-444-4444', '555-555-5555', '666-666-6666'],
    'QUALIFICATION': ['Master', 'Bachelor', 'Bachelor']
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
concatenated_df = pd.concat([df1, df2], join='outer')
print("Concatenated DataFrame with outer join:")
print(concatenated_df)

Concatenated DataFrame with outer join:
      NAME  AGE       ADDRESS     MOBILE NO QUALIFICATION
0    Alice   20   123 Main St  111-111-1111      Bachelor
1      Bob   22    456 Elm St  222-222-2222        Master
2  Charlie   21    789 Oak St  333-333-3333           PhD
0    David   23   321 Pine St  444-444-4444        Master
1      Eve   24  654 Cedar St  555-555-5555      Bachelor
2    Frank   25  987 Maple St  666-666-6666      Bachelor

EXERCISE 5.11 Now concatenate the dataframe by specifying the join_axes using variable res4

In [ ]:
import pandas as pd

data1 = {
    'NAME': ['Alice', 'Bob', 'Charlie'],
    'AGE': [20, 22, 21],
    'ADDRESS': ['123 Main St', '456 Elm St', '789 Oak St'],
    'MOBILE NO': ['111-111-1111', '222-222-2222', '333-333-3333'],
    'QUALIFICATION': ['Bachelor', 'Master', 'PhD']
}

data2 = {
    'NAME': ['David', 'Eve', 'Frank'],
    'AGE': [23, 24, 25],
    'ADDRESS': ['321 Pine St', '654 Cedar St', '987 Maple St'],
    'MOBILE NO': ['444-444-4444', '555-555-5555', '666-666-6666'],
    'QUALIFICATION': ['Master', 'Bachelor', 'Bachelor']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

res4 = df1.columns

concatenated_df = pd.concat([df1, df2], join='outer').reindex(columns=res4)

print("Concatenated DataFrame with join_axes specified using res4:")
print(concatenated_df)

Concatenated DataFrame with join_axes specified using res4:
      NAME  AGE       ADDRESS     MOBILE NO QUALIFICATION
0    Alice   20   123 Main St  111-111-1111      Bachelor
1      Bob   22    456 Elm St  222-222-2222        Master
2  Charlie   21    789 Oak St  333-333-3333           PhD
0    David   23   321 Pine St  444-444-4444        Master
1      Eve   24  654 Cedar St  555-555-5555      Bachelor
2    Frank   25  987 Maple St  666-666-6666      Bachelor

EXERCISE 5.12 Create two dataframes d1 and d2 for a college with attributes as college name, dept_name,no_staff,intake and concatenate them using append() and store it in variable named res

In [ ]:
import pandas as pd

data1 = {
    'college_name': ['College A', 'College B', 'College C'],
    'dept_name': ['Dept 1', 'Dept 2', 'Dept 3'],
    'no_staff': [10, 15, 20],
    'intake': [100, 150, 200]
}

data2 = {
    'college_name': ['College D', 'College E', 'College F'],
    'dept_name': ['Dept 4', 'Dept 5', 'Dept 6'],
    'no_staff': [12, 18, 25],
    'intake': [120, 180, 250]
}

d1 = pd.DataFrame(data1)
d2 = pd.DataFrame(data2)

res = pd.concat([d1, d2], ignore_index=True)
print("Concatenated DataFrame using append:")
print(res)

Concatenated DataFrame using append:
  college_name dept_name  no_staff  intake
0    College A    Dept 1        10     100
1    College B    Dept 2        15     150
2    College C    Dept 3        20     200
3    College D    Dept 4        12     120
4    College E    Dept 5        18     180
5    College F    Dept 6        25     250

EXERCISE 5.13 Now concatenate the two data frames obtained in the above exercises by using ignoreindex and store in variable res

In [ ]:
import pandas as pd

data1 = {
    'college_name': ['College A', 'College B', 'College C'],
    'dept_name': ['Dept 1', 'Dept 2', 'Dept 3'],
    'no_staff': [10, 15, 20],
    'intake': [100, 150, 200]
}

data2 = {
    'college_name': ['College D', 'College E', 'College F'],
    'dept_name': ['Dept 4', 'Dept 5', 'Dept 6'],
    'no_staff': [12, 18, 25],
    'intake': [120, 180, 250]
}

d1 = pd.DataFrame(data1)
d2 = pd.DataFrame(data2)
res = pd.concat([d1, d2], ignore_index=True)
print("Concatenated DataFrame with ignore_index:")
print(res)

Concatenated DataFrame with ignore_index:
  college_name dept_name  no_staff  intake
0    College A    Dept 1        10     100
1    College B    Dept 2        15     150
2    College C    Dept 3        20     200
3    College D    Dept 4        12     120
4    College E    Dept 5        18     180
5    College F    Dept 6        25     250

EXRCISE 5.14 Concatenate dataframes created above with group keys

In [ ]:
import pandas as pd

data1 = {
    'college_name': ['College A', 'College B', 'College C'],
    'dept_name': ['Dept 1', 'Dept 2', 'Dept 3'],
    'no_staff': [10, 15, 20],
    'intake': [100, 150, 200]
}

data2 = {
    'college_name': ['College D', 'College E', 'College F'],
    'dept_name': ['Dept 4', 'Dept 5', 'Dept 6'],
    'no_staff': [12, 18, 25],
    'intake': [120, 180, 250]
}

d1 = pd.DataFrame(data1)
d2 = pd.DataFrame(data2)
res = pd.concat([d1, d2], keys=['Group1', 'Group2'])
print("Concatenated DataFrame with group keys:")
print(res)

Concatenated DataFrame with group keys:
         college_name dept_name  no_staff  intake
Group1 0    College A    Dept 1        10     100
       1    College B    Dept 2        15     150
       2    College C    Dept 3        20     200
Group2 0    College D    Dept 4        12     120
       1    College E    Dept 5        18     180
       2    College F    Dept 6        25     250

EXERCISE 5.15 Create 2 dataframes 'df','df1','df2' with attributes 'subject_id' 'last_name' and 'first_name' and 3rd dataframe of name raw_data with attributes 'subject_id' and 'last_id' with labels 0,1,2,3,4

In [ ]:
import pandas as pd

data_df = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df1 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

data_df2 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_raw = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'last_id': [1, 2, 3, 4, 5]
}

df = pd.DataFrame(data_df)
df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)
raw_data = pd.DataFrame(data_raw, index=[0, 1, 2, 3, 4])

print("DataFrame df:")
print(df)
print("\nDataFrame df1:")
print(df1)
print("\nDataFrame df2:")
print(df2)
print("\nDataFrame raw_data:")
print(raw_data)

DataFrame df:
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

DataFrame df1:
  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

DataFrame df2:
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

DataFrame raw_data:
  subject_id  last_id
0          1        1
1          2        2
2          3        3
3          4        4
4          5        5

EXERCISE 5.16 Merge the 2 dataframes along rows in df_new

In [ ]:
import pandas as pd

data_df = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df1 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

df = pd.DataFrame(data_df)
df1 = pd.DataFrame(data_df1)

df_new = pd.concat([df, df1], axis=0, ignore_index=True)

print("Merged DataFrame along rows (df_new):")
print(df_new)

Merged DataFrame along rows (df_new):
  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Btisan

EXERCISE 5.17 Merge the two dataframes df1 and df2 alon columns

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

data_df2 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)

df_new_columns = pd.concat([df1, df2], axis=1)

print("Merged DataFrame along columns (df_new_columns):")
print(df_new_columns)

Merged DataFrame along columns (df_new_columns):
  subject_id first_name last_name subject_id first_name last_name
0          4      Billy    Bonder          1       Alex  Anderson
1          5      Brian     Black          2        Amy  Ackerman
2          6       Bran   Balwner          3      Allen       Ali
3          7      Bryce     Brice          4      Alice      Aoni
4          8      Betty    Btisan          5     Ayoung   Atiches

EXERCISE 5.18 Merg new dataframe created with df3 along subject_id value

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

data_df2 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)
# Concatenate along rows to avoid duplicate 'subject_id' columns
df_new_rows = pd.concat([df1, df2], axis=0)
data_df3 = {
    'subject_id': ['1', '2', '3', '4', '5', '6', '7'],
    'score': [88, 92, 95, 70, 89, 92, 85]
}

df3 = pd.DataFrame(data_df3)
# Now merge the dataframes on 'subject_id'
merged_df = pd.merge(df_new_rows, df3, on='subject_id')
print("Merged DataFrame along subject_id (merged_df):")
print(merged_df)

Merged DataFrame along subject_id (merged_df):
  subject_id first_name last_name  score
0          4      Billy    Bonder     70
1          4      Alice      Aoni     70
2          5      Brian     Black     89
3          5     Ayoung   Atiches     89
4          6       Bran   Balwner     92
5          7      Bryce     Brice     85
6          1       Alex  Anderson     88
7          2        Amy  Ackerman     92
8          3      Allen       Ali     95

EXERCISE 5.19 Merge two dataframes with both the left and right dataframes using the subject_id key

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df2 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)
merged_df = pd.merge(df1, df2, on='subject_id', suffixes=('_left', '_right'))
print("Merged DataFrame using subject_id as key (merged_df):")
print(merged_df)

Merged DataFrame using subject_id as key (merged_df):
  subject_id first_name_left last_name_left first_name_right last_name_right
0          4           Alice           Aoni            Billy          Bonder
1          5          Ayoung        Atiches            Brian           Black

EXERCISE 5.20 Merge dataframe df1 and df2 with outer join ON subject_id

In [ ]:
import pandas as pd
data_df1 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df2 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)
merged_df = pd.merge(df1, df2, on='subject_id', how='outer', suffixes=('_df1', '_df2'))
print("Merged DataFrame using outer join on subject_id (merged_df):")
print(merged_df)

Merged DataFrame using outer join on subject_id (merged_df):
  subject_id first_name_df1 last_name_df1 first_name_df2 last_name_df2
0          1           Alex      Anderson            NaN           NaN
1          2            Amy      Ackerman            NaN           NaN
2          3          Allen           Ali            NaN           NaN
3          4          Alice          Aoni          Billy        Bonder
4          5         Ayoung       Atiches          Brian         Black
5          6            NaN           NaN           Bran       Balwner
6          7            NaN           NaN          Bryce         Brice
7          8            NaN           NaN          Betty        Btisan

EXERCISE 5.21 Merge dataframe df1 and df2 with right join on subject_id

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df2 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}
df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)
merged_df = pd.merge(df1, df2, on='subject_id', how='right', suffixes=('_df1', '_df2'))
print("Merged DataFrame using right join on subject_id (merged_df):")
print(merged_df)

Merged DataFrame using right join on subject_id (merged_df):
  subject_id first_name_df1 last_name_df1 first_name_df2 last_name_df2
0          4          Alice          Aoni          Billy        Bonder
1          5         Ayoung       Atiches          Brian         Black
2          6            NaN           NaN           Bran       Balwner
3          7            NaN           NaN          Bryce         Brice
4          8            NaN           NaN          Betty        Btisan

EXERCISE 5.22 Merge dataframe df1 and df2 with LEFT join on subject_id

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df2 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)

merged_df = pd.merge(df1, df2, on='subject_id', how='left', suffixes=('_df1', '_df2'))

print("Merged DataFrame using left join on subject_id (merged_df):")
print(merged_df)

Merged DataFrame using left join on subject_id (merged_df):
  subject_id first_name_df1 last_name_df1 first_name_df2 last_name_df2
0          1           Alex      Anderson            NaN           NaN
1          2            Amy      Ackerman            NaN           NaN
2          3          Allen           Ali            NaN           NaN
3          4          Alice          Aoni          Billy        Bonder
4          5         Ayoung       Atiches          Brian         Black

EXERCISE 5.23 Merge df1 and df2 while adding a suffix to duplicate column names on subject_id

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df2 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)

merged_df = pd.merge(df1, df2, on='subject_id', how='inner', suffixes=('_df1', '_df2'))

print("Merged DataFrame with suffixes for duplicate column names (merged_df):")
print(merged_df)

Merged DataFrame with suffixes for duplicate column names (merged_df):
  subject_id first_name_df1 last_name_df1 first_name_df2 last_name_df2
0          4          Alice          Aoni          Billy        Bonder
1          5         Ayoung       Atiches          Brian         Black

EXERCISE 5.24 Merge df1 and df2 ON subject_id based on index attribute

In [ ]:
import pandas as pd

data_df1 = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}

data_df2 = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}

df1 = pd.DataFrame(data_df1)
df2 = pd.DataFrame(data_df2)

df1.set_index('subject_id', inplace=True)
df2.set_index('subject_id', inplace=True)

merged_df = pd.merge(df1, df2, left_index=True, right_index=True, suffixes=('_df1', '_df2'))

print("Merged DataFrame based on index attribute (merged_df):")
print(merged_df)

Merged DataFrame based on index attribute (merged_df):
           first_name_df1 last_name_df1 first_name_df2 last_name_df2
subject_id
4                   Alice          Aoni          Billy        Bonder
5                  Ayoung       Atiches          Brian         Black

EXERCISE 5.25 Create two dataframes d1 and d2 with list as name, id in d1 and marks , age in d2. And then perform join on d1 and d2.Add name as AB,AC,AD id as 1,2,3 subject as C0,C2,C3 and age as 20,19,18 with k1 as K0,K2,K3 in d1 and k2 as K0,K2,K3 in d2

In [ ]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD'],
    'id': [1, 2, 3],
    'k1': ['K0', 'K2', 'K3']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k2': ['K0', 'K2', 'K3']
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)

d1.set_index('k1', inplace=True)
d2.set_index('k2', inplace=True)

joined_df = d1.join(d2)

print("Joined DataFrame (joined_df):")
print(joined_df)

Joined DataFrame (joined_df):
   name  id subject  age
k1
K0   AB   1      C0   20
K2   AC   2      C2   19
K3   AD   3      C3   18

EXERCISE 5.26 use the dataframes created above and perform Outer join on them

In [ ]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD'],
    'id': [1, 2, 3],
    'k1': ['K0', 'K2', 'K3']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k2': ['K0', 'K2', 'K3']
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)

merged_df = pd.merge(d1, d2, left_on='k1', right_on='k2', how='outer', suffixes=('_d1', '_d2'))

print("Merged DataFrame using outer join (merged_df):")
print(merged_df)

Merged DataFrame using outer join (merged_df):
  name  id  k1 subject  age  k2
0   AB   1  K0      C0   20  K0
1   AC   2  K2      C2   19  K2
2   AD   3  K3      C3   18  K3

EXERCISE 5.27 Use the dataframes d1 and d2 and perform inner join on them

In [ ]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD'],
    'id': [1, 2, 3],
    'k1': ['K0', 'K2', 'K3']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k2': ['K0', 'K2', 'K3']
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)

merged_df = pd.merge(d1, d2, left_on='k1', right_on='k2', how='inner', suffixes=('_d1', '_d2'))

print("Merged DataFrame using inner join (merged_df):")
print(merged_df)

Merged DataFrame using inner join (merged_df):
  name  id  k1 subject  age  k2
0   AB   1  K0      C0   20  K0
1   AC   2  K2      C2   19  K2
2   AD   3  K3      C3   18  K3

EXERCISE 5.28 Perform join on d1 and d2 w.r.t. column 'name'

In [ ]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD'],
    'id': [1, 2, 3],
    'k1': ['K0', 'K2', 'K3']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k2': ['K0', 'K2', 'K3'],
    'name': ['AB', 'AC', 'AD']
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)

joined_df = pd.merge(d1, d2, on='name', suffixes=('_d1', '_d2'))

print("Joined DataFrame with respect to the column 'name' (joined_df):")
print(joined_df)

Joined DataFrame with respect to the column 'name' (joined_df):
  name  id  k1 subject  age  k2
0   AB   1  K0      C0   20  K0
1   AC   2  K2      C2   19  K2
2   AD   3  K3      C3   18  K3

EXERCISE 5.29 Add two elements in d1- k1 and k3 and then create a multiindex i and then perform join on d1 and d2 w.r.t k1 and k3

In [ ]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD', 'AE'],
    'id': [1, 2, 3, 4],
    'k1': ['K0', 'K2', 'K3', 'K4'],
    'k3': ['M0', 'M2', 'M3', 'M4']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k1': ['K0', 'K2', 'K3'] # Changed 'k2' to 'k1' to match the index name in d1
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)

d1.set_index(['k1', 'k3'], inplace=True)
d2.set_index('k1', inplace=True) # Use 'k1' as the index for d2

joined_df = d1.join(d2, how='left')
print("Joined DataFrame with respect to multi-index 'k1' and 'k3' (joined_df):")
print(joined_df)

Joined DataFrame with respect to multi-index 'k1' and 'k3' (joined_df):
      name  id subject   age
k1 k3
K0 M0   AB   1      C0  20.0
K2 M2   AC   2      C2  19.0
K3 M3   AD   3      C3  18.0
K4 M4   AE   4     NaN   NaN

EXERCISE 5.30 create a dataframe d3 with elements as 'clg' and 'index' and then perform join on d1,d2,d3

In [ ]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD', 'AE'],
    'id': [1, 2, 3, 4],
    'k1': ['K0', 'K2', 'K3', 'K4'],
    'k3': ['M0', 'M2', 'M3', 'M4']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k2': ['K0', 'K2', 'K3']
}

data_d3 = {
    'clg': ['A', 'B', 'C', 'D'],
    'index': [0, 1, 2, 3]
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)
d3 = pd.DataFrame(data_d3)

joined_df = pd.merge(pd.merge(d1, d2, left_on='k1', right_on='k2', how='outer'),
                     d3, left_index=True, right_index=True)

print("Joined DataFrame with d1, d2, and d3:")
print(joined_df)

Joined DataFrame with d1, d2, and d3:
  name  id  k1  k3 subject   age   k2 clg  index
0   AB   1  K0  M0      C0  20.0   K0   A      0
1   AC   2  K2  M2      C2  19.0   K2   B      1
2   AD   3  K3  M3      C3  18.0   K3   C      2
3   AE   4  K4  M4     NaN   NaN  NaN   D      3

EXERCISE 5.31 Perform join on d1 and d2 with column name appended with a value as l and r

In [11]:
import pandas as pd

data_d1 = {
    'name': ['AB', 'AC', 'AD', 'AE'],
    'id': [1, 2, 3, 4],
    'k1': ['K0', 'K2', 'K3', 'K4'],
    'k3': ['M0', 'M2', 'M3', 'M4']
}

data_d2 = {
    'subject': ['C0', 'C2', 'C3'],
    'age': [20, 19, 18],
    'k2': ['K0', 'K2', 'K3']
}

d1 = pd.DataFrame(data_d1)
d2 = pd.DataFrame(data_d2)

joined_df = pd.merge(d1, d2, left_on='k1', right_on='k2', how='outer', suffixes=('_l', '_r'))

print("Joined DataFrame with column names appended with 'l' and 'r' (joined_df):")
print(joined_df)

Joined DataFrame with column names appended with 'l' and 'r' (joined_df):
  name  id  k1  k3 subject   age   k2
0   AB   1  K0  M0      C0  20.0   K0
1   AC   2  K2  M2      C2  19.0   K2
2   AD   3  K3  M3      C3  18.0   K3
3   AE   4  K4  M4     NaN   NaN  NaN